<script setup lang="js">
import { ref } from 'vue';
import { useRouter } from 'vue-router';

const dialog = ref(true)

const router = useRouter()

const close = () =>{
    dialog.value = false
}

const back = ()=>{
  router.push({name:'menu'})
}
</script>

<template>
  <v-dialog v-model="dialog" fullscreen @after-leave="back">
    <v-card>
      <v-toolbar>
        <v-toolbar-title> О проекте </v-toolbar-title>
        <v-spacer></v-spacer>
        <v-btn icon="mdi-close" @click="close"></v-btn>
      </v-toolbar>
      <div class="pa-5">
        <p>
          Енисей – главная водная артерия Сибири – входит в число семи крупных
          рек мира и является наиболее полноводной рекой нашей страны. В
          результате широко развернувшегося гидростроительства бассейн Енисея
          превращен в каскад крупнейших в мире водохранилищ, что повлекло за
          собой коренное изменение гидрологического, гидрохимического и
          гидробиологического режимов. Кроме того, водотоки бассейна Енисея
          испытывают многогранную антропогенную нагрузку, получая широкий спектр
          загрязнений с промышленными, бытовыми и сельскохозяйственными стоками
          и подвергаясь техногенному морфогенезу в результате разработки
          месторождений. Происходящие экологические перестройки в сообществах
          гидробионтов требуют углубленного изучения и мониторинга, как для
          оценки наносимого экологического ущерба, так и для выработки научных
          основ стратегии преодоления негативных последствий и восстановления
          биологического потенциала бассейна Енисея.
        </p>
        <p>
          Увеличение антропогенного влияния на водные объекты на протяжении
          последних 50 лет привело к необходимости усиленного мониторинга,
          развитию методов оценки, поисков объективных критериев, комплексных
          показателей качества поверхностных вод. Оценка качества вод является
          одной из наиболее актуальных и приоритетных задач устойчивого развития
          водного хозяйства России. Определять экологическое состояние водных
          объектов возможно посредством как химических, так и биологических (то
          есть оценка качества природной среды по состоянию её биоты) методов. В
          системе Росгидромета контроль качества водной среды осуществляется в
          основном посредством химических и физико-химических методов. Однако
          они не позволяют дать полную характеристику вредного воздействия
          антропогенных факторов на биологические сообщества. Поэтому во многих
          странах наряду с химическим проводится и биологический контроль,
          который зачастую оказывается приоритетным.
        </p>
        <p>
          Целью данного Проекта являлась комплексная оценка экологического
          состояния р. Енисей посредством химических и биологических показателей
          с последующей визуализацией в ГИС. Реализация геоинформационной
          системы Енисея позволила интегрировать в единое целое и
          систематизировать данные по качеству воды р. Енисей.
        </p>
        <p>
          Геоинформационная система «Комплексная оценка качества вод р. Енисей»
          разработана в ходе научно-исследовательской деятельности по теме
          «Методология комплексной оценки и формирование геопространственной
          базы данных экологического состояния р. Енисей» в рамках Программы
          деятельности научно-образовательного центра мирового уровня
          «Енисейская Сибирь» по направлению «Глобальные климатические
          инициативы».
        </p>
        <p>
          Назначение проекта: Улучшение состояния окружающей среды,
          совершенствование систем мониторинга и прогнозирования, внедрение
          оригинальных методов оценки экологического состояния водных объектов,
          развитие рекреационного потенциала водных объектов.
        </p>
        <p>
          В реализации проекта участвовали сотрудники Института вычислительного
          моделирования Сибирского отделения РАН и Сибирского государственного
          университета науки и технологий имени академика М.Ф. Решетнева.
        </p>
      </div>
    </v-card>
  </v-dialog>
</template>

<style scoped>
p {
  text-align: justify;
  text-indent: 1rem;
  line-height: 30px;
}
</style>
