<script setup lang="js">
import { ref } from 'vue';
import { useRouter } from 'vue-router';

const dialog = ref(true)

const router = useRouter()

const close = () =>{
    dialog.value = false
}

const back = ()=>{
  router.push({name:'biology'})
}
</script>

<template>
  <v-dialog v-model="dialog" fullscreen @after-leave="back">
    <v-card>
      <v-toolbar>
        <v-toolbar-title> О проекте </v-toolbar-title>
        <v-spacer></v-spacer>
        <v-btn icon="mdi-close" @click="close"></v-btn>
      </v-toolbar>
      <div class="d-flex flex-column align-center pa-5">
        <p>
          В комплексном экологическом мониторинге водных объектов биологический
          анализ является важной составляющей. Биологический контроль, или
          биоиндикация – это оценка состояния водных экосистем или их
          компонентов по структурным характеристикам сообществ гидробионтов,
          используя их биологические свойства. Сообщества водных организмов
          отражают совокупное воздействие факторов среды на состояние водных
          экосистем и качество поверхностных вод. Принцип биоиндикации основан
          на общем разнообразии гидробионтов и наличии в водоеме индикаторных
          организмов, которые при повышении степени загрязненности водоема
          исчезают из сообщества в определенном порядке. Биологический метод, в
          отличие от физико-химических, позволяет определять качество водного
          объекта не только в момент отбора проб, но и за более ранний период.
        </p>
        <p>
          Общепризнано, что наиболее удобным, информативным и надежным
          биоиндикатором состояния водной среды и ее антропогенных изменений
          является зообентос – это беспозвоночные животные, обитающие в водоемах
          на поверхности грунта и в его толще. В пресных водоёмах в состав
          зообентоса входят простейшие, губки, черви, пиявки, мшанки, моллюски и
          личинки насекомых. Существует четкая связь между показателями
          зообентоса и содержанием загрязняющих веществ в придонных слоях воды и
          донных отложениях. Под влиянием загрязнения происходят структурные
          перестройки донных сообществ и снижение видового разнообразия.
          Организмы зообентоса являются индикатором качества воды,
          характеризующим большой период времени и незначительно реагируют на
          кратковременное изменение качества воды. Рекомендуется использовать
          комплексный подход, включающий набор разнообразных биоиндикационных
          показателей.
        </p>
        <p>
          Представленная ГИС демонстрирует оценку экологического состояния
          Енисея методами биоиндикации по сообществам зообентоса. Для реализации
          проекта привлечены результаты многолетних гидробиологических
          исследований Енисея (2000-2003, 2015, 2016, 2020, 2022 гг.). На всем
          протяжении реки исследованы 5 участков, из них 3 расположены в Верхнем
          Енисее: 1 – Республика Тыва, между гг. Кызыл и Шагонар, 2 – ниже
          Саяно-Шушенского водохранилища, между гг. Саяногорск и Минусинск, 3 –
          от плотины Красноярской ГЭС до устья р. Ангара. Участок 4 находится в
          Среднем Енисее – от устья Ангары до д. Сургутиха; участок 5 – в Нижнем
          Енисее от г. Дудинка до дельты, включая Бреховские острова.
        </p>
        <p>
          Для оценки качества воды по донным организмам использовали комплексный
          подход из 13 биоиндикационных индексов и метрик: количество видов в
          пробе (n), индекс видового разнообразия Шеннона (Н), хирономидный
          индекс Балушкиной (К), олигохетный индекс Гуднайта (G), EPT-индексы
          (число видов в пробе EPT<sub>n</sub>, численность EPT<sub>N</sub>
          (г/м2) и относительная численность EPT<sub>N%</sub> поденок, веснянок
          и ручейников), FBI (Family Biotic Index), IBGN (Indice Biologique
          Global Normalize), BMWP (Biological Monitoring Working Party Index) и
          его производное ASPT (Average Score Per Taxon Index),
          EPT<sub>n</sub>/Ch<sub>n</sub> и EPT<sub>N</sub>/Ch<sub>N</sub> –
          соотношение числа видов и численности группы EPT к хирономидам.
        </p>
        <p>
          В качестве обобщающей величины по совокупности всех индексов и метрик
          посредством методов многомерной статистики был разработан интегральный
          показатель (IP). Методология построения IP позволила выявить не только
          общий градиент загрязнения вдоль всего неоднородного продольного
          профиля Енисея, но и ранжировать контрольные станции в единой системе
          градаций качества воды. наилучшее качество вод «условно чистые»
          выявлено в верховье Енисея (станции 1.1, 1.2). Далее вниз по течению
          происходило постепенное ухудшение качества вод, и после Красноярского
          водохранилища (участок 3) вода классифицирована преимущественно как
          «грязная». После впадения р. Ангары (участок 4) наблюдалось улучшение
          качества вод. И если в километре от устья Ангары (станция 4.1) еще
          сохранялась «грязная» категория, то далее происходило самоочищение
          воды до «загрязненной» и «слабо загрязненной». Начиная со станции 4.14
          (пос. Бор) снова наблюдалось ухудшение качества воды, и все низовье
          Енисея попадало в категорию «грязная». Таким образом, наилучшее
          качество вод в Енисее связано с верховьем реки и высоким разнообразием
          донных организмов. Ниже плотин крупных ГЭС наблюдалось ухудшение
          качества вод, а поступление вод р. Ангары напротив оказывало
          благоприятное влияние на экологическое состояние Енисея. В низовье в
          условиях равнинного течения происходит обеднение донной фауны и
          снижение качества вод.
        </p>
      </div>
    </v-card>
  </v-dialog>
</template>

<style scoped>
p {
  text-align: justify;
  text-indent: 1rem;
  line-height: 30px;
}

.footnote {
  font-size: 14px;
}
</style>
