<script setup lang="ts">
import { ref } from 'vue';
import { useRouter } from 'vue-router';

const dialog = ref(true)

const router = useRouter()

const close = () => {
  dialog.value = false
}

const back = () => {
  router.push({ name: 'chemistry' })
}
</script>

<template>
  <v-dialog v-model="dialog" fullscreen @after-leave="back">
    <v-card>
      <v-toolbar>
        <v-toolbar-title>О проекте </v-toolbar-title>
        <v-spacer></v-spacer>
        <v-btn icon="mdi-close" @click="close"></v-btn>
      </v-toolbar>
      <div class="pa-5">
        <p>
          Согласно «Водному кодексу» РФ (Статья 30), государственный мониторинг
          водных объектов представляет собой систему наблюдений, оценки и
          прогноза изменений состояния водных объектов, находящихся в
          федеральной собственности, собственности субъектов Российской
          Федерации, собственности муниципальных образований, собственности
          физических лиц, юридических лиц. Мониторинг поверхностных вод суши и
          донных отложений осуществляет Федеральная служба по гидрометеорологии
          и мониторингу окружающей среды
          <span class="footnote">
            [Положение об осуществлении государственного мониторинга водных
            объектов, 2007].
          </span>
        </p>
        <p>
          Представленная ГИС включает в себя перечень из 24 створов
          гидрохимических наблюдений по всей длине р. Енисей: от истока – р.
          Малый Енисей в районе с. Сарыг-Сеп в республике Тыва до устьевой части
          – р. Енисей, в районе г. Дудинка. Приведены показатели по превышению
          ПДК (предельно-допустимых концентраций) органических веществ,
          биогенных соединений, металлов и специфических загрязнителей
          поверхностных вод р. Енисей за период с 2010 по 2022 гг. Для всех
          химических веществ использовались ПДК для водных объектов
          рыбохозяйственного значения
          <span class="footnote">
            [Приказ Министерства сельского хозяйства Российской Федерации от
            13.12.2016 № 552 «Об утверждении нормативов качества воды водных
            объектов рыбохозяйственного значения, в том числе нормативов
            предельно допустимых концентраций вредных веществ в водах водных
            объектов рыбохозяйственного значения»];
          </span>
          лишь в случае ХПК использовался норматив для воды
          хозяйственно-питьевого водоснабжения.
          <span class="footnote">
            [СанПиН 1.2.3685-21 Гигиенические нормативы и требования к
            обеспечению безопасности и (или) безвредности для человека факторов
            среды обитания].
          </span>
        </p>
        <p>
          Поскольку в каждом створе наблюдения фиксируется несколько
          загрязняющих веществ, необходимо единое значение, характеризующее
          степень чистоты водотока в конкретном месте реки. Для этого нужна
          обобщенная, интегральная оценка качества воды – удельный комбинаторный
          индекс загрязненности воды – УЗИЗВ
          <span class="footnote">[РД 52.24.643-2002]</span>. Благодаря УКИЗВ,
          возможно оценить загрязнённость вод, не оперируя внушительным рядом
          данных по каждому веществу. Возможно сравнение и сопоставление
          результатов постов с различной программой наблюдения, что снижает
          фактор ошибки. Значение УКИЗВ определяется по частоте и кратности
          превышения ПДК по нескольким показателям и может варьировать в водах
          различной степени загрязнённости от 1 до 16 (для чистой воды 0).
          Большему значению индекса соответствует худшее качество воды.
          Классификация качества пресной воды, проведенная на основе значений
          УКИЗВ, позволяет разделять поверхностные воды на 5 классов в
          зависимости от степени их загрязненности: 1-й класс – условно чистая;
          2-й класс – слабо загрязненная; 3-й класс – загрязненная; 4-й класс –
          грязная; 5-й класс - экстремально грязная.
        </p>
        <p>
          В воде Енисея регулярно отмечается нарушение рыбохозяйственных
          нормативов по содержанию Al, Fe, Zn, Mn, Cu, фенолов и нефтепродуктов.
          Анализируя значения УКИЗВ, можно видеть высокую флуктуацию по течению
          Енисея классов загрязненности от 1 (условно чистая) до 4в (очень
          грязная).
        </p>
        <p>
          Воды р. Малый Енисей в последние годы характеризуются слабым
          загрязнением (2 класс качества). На р. Енисей фиксируются несколько
          зон существенного ухудшения качества воды – ниже г. Кызыла и далее по
          течению в Саяно-Шушенском водохранилище (класс качества 3б, очень
          загрязненная), в районе села Селиваниха (от 3а, загрязнённая до 4в,
          очень грязная). Из-за накопившегося загрязнения и внесения
          дополнительной техногенной нагрузки Красноярской агломерации от поста
          наблюдения «р. Енисей, 35 км ниже г. Красноярск» и вплоть до самого
          устья тянется зона повышенного содержания загрязняющих веществ, что
          снижает качество воды до 3б – 4а (грязная) в районе г. Дудинка. Таким
          образом, совокупное влияние антропогенного загрязнения и
          гидротехнических сооружений вызывает цепочку последующих
          гидрохимических реакций: а) аккумуляции в ложах водохранилищ биогенных
          элементов и органического вещества; б) снижение самоочищающей
          способности; в) уменьшение скорости биодеградации загрязняющих веществ
          и увеличение их концентрации в воде.
        </p>
      </div>
    </v-card>
  </v-dialog>
</template>

<style scoped>
p {
  text-align: justify;
  text-indent: 1rem;
  line-height: 30px;
}

.footnote {
  font-size: 14px;
}
</style>
